<script setup lang="ts">
import gsap from 'gsap'
import { ScrollTrigger } from 'gsap/ScrollTrigger'

const raiseBlock = ref<HTMLElement>()

gsap.registerPlugin(ScrollTrigger)

let ctx = null as gsap.Context | null

const isShownContent = ref(false)

const isShownWordsSection = ref(false)

onMounted(() => {
  ctx = gsap.context((self) => {
    if (!self)
      return
    const elBlock = self.selector('.scroll-block')

    const elLine = self.selector('.scroll-line')

    const elText = self.selector('#gtheading')

    const elAchievment = self.selector('.achievment')

    // const boxes = self.selector('.box');
    elBlock.forEach((child) => {
      gsap.to(child, {
        width: '80%',
        duration: 1,
        scrollTrigger: {
          start: 'top top',
          pin: document.querySelector('.main'),
          scrub: 0.1,
          onUpdate: (self) => {
            if (self.progress.toFixed(3) >= 0.5)
              isShownContent.value = true
            else
              isShownContent.value = false
          },
          // onToggle: () => {
          //   setTimeout(() => {
          //     isShownContent.value = true
          //   }, 500)
          // },
        },
      })
    })
    elLine.forEach((child) => {
      gsap.to(child, {
        x: '100%',
        scrollTrigger: {
          start: 'top top',
          end: 'bottom bottom',
          scrub: 1,
          onLeave: () => {
            isShownWordsSection.value = true
          },
        },
      })
    })

    elText.forEach((child) => {
      gsap.to(child, {
        x: '-100%',
        duration: 2,
        scrollTrigger: {
          scrub: 1,
          pin: document.querySelector('.section-words'),
        },
      })
    })

    gsap.timeline({
      scrollTrigger: {
        trigger: ".achievment-1",
        start: "center center",
        scrub: 1,
      },
    })
      .fromTo('.achievment-1', {
        x: '-100%',
        duration: 1,
      }, {
        x: '0',
        duration: 1,
      })
      .fromTo('.achievment-2', {
        x: '100%',
        duration: 1,
      }, {
        x: '0',
        duration: 1,
      })
      .fromTo('.achievment-3', {
        x: '-100%',
        duration: 1,
      }, {
        x: '0',
        duration: 1,
      })
      .fromTo('.achievment-4', {
        x: '100%',
        duration: 1,
      }, {
        x: '0',
        duration: 1,
      })
      .fromTo('.achievment-5', {
        x: '-100%',
        duration: 1,
      }, {
        x: '0',
        duration: 1,
      })
      .fromTo('.achievment-6', {
        x: '100%',
        duration: 1,
      }, {
        x: '0',
        duration: 1,
      })

    elAchievment.forEach((child) => {
      const direction = child.dataset.direction
      if (direction === 'left') {
        // gsap.to(child, {
        //   x: '0',
        //   duration: 1,
        // })
      } else {
        // gsap.fromTo(child, {
        //   x: '100%',
        //   duration: 1,
        // }, {
        //   x: '0',
        //   duration: 1,
        // })
      }
    })
  }, raiseBlock.value)
})

onUnmounted(() => {
  ctx?.revert()
})
</script>

<template>
  <div ref="raiseBlock" class="overflow-hidden">
    <section class="main flex h-screen">
      <div class="relative flex h-full w-full items-center justify-center">
        <div class="">
          <img src="~/assets/images/logo-big.png" alt="" class="h-[500px] w-[400px]">
        </div>
        <div class="scroll-line absolute bottom-16 left-9 z-50 flex w-full items-center justify-between">
          <p class="max-w-[480px] text-h2 text-white">
            От идеи до совершенства: ваше мероприятие в надежных руках!
          </p>
          <div class="h-[2px] w-full max-w-[700px] bg-white" />
        </div>
      </div>

      <div class="scroll-block relative h-full w-[20%] overflow-hidden bg-black">
        <div class="flex flex-col items-center p-[100px] transition-opacity duration-300" :class="`${isShownContent ? 'opacity-1' : 'opacity-0'}`">
          <div class="relative mb-20">
            <svg width="185" height="139" viewBox="0 0 185 139" fill="none" xmlns="http://www.w3.org/2000/svg">
              <path d="M120.107 102.022L120.104 102.028C118.07 107.022 115.448 111.679 112.241 115.997C109.006 120.352 105.058 124.111 100.408 127.273L100.397 127.28L100.397 127.28C95.7373 130.387 90.3558 132.825 84.2688 134.608C78.2032 136.402 71.3424 137.288 63.7031 137.288C56.0618 137.288 49.1713 136.402 43.0471 134.608L43.0431 134.607C37.0162 132.823 31.6665 130.385 27.0093 127.28L26.9978 127.273L26.9978 127.273C22.3482 124.111 18.4005 120.352 15.165 115.997C11.958 111.679 9.33655 107.022 7.30178 102.028L7.29936 102.022C5.26937 96.9777 3.79535 91.6622 2.87495 86.0784C1.95852 80.5187 1.5 74.957 1.5 69.394C1.5 63.7723 1.95829 58.2101 2.87514 52.7085C3.79478 47.1298 5.23719 41.8477 7.20551 36.8654L7.20902 36.8565L7.20904 36.8565C9.2436 31.8009 11.8656 27.1115 15.0747 22.7915C18.3091 18.4375 22.2266 14.7078 26.819 11.6046C31.4809 8.43476 36.8658 5.96434 42.9567 4.18012C49.082 2.38586 56.0028 1.5 63.7031 1.5C71.4034 1.5 78.3243 2.38586 84.4495 4.18012C90.5382 5.96368 95.8937 8.43365 100.497 11.6047C105.148 14.7068 109.096 18.4361 112.332 22.7915C115.541 27.1125 118.134 31.8035 120.109 36.8611C122.138 41.8442 123.611 47.1274 124.531 52.707L120.107 102.022ZM120.107 102.022C122.137 96.9777 123.611 91.6622 124.531 86.0784C125.448 80.5187 125.906 74.957 125.906 69.394C125.906 63.7718 125.448 58.2092 124.531 52.7072L120.107 102.022ZM55.8984 36.2225L55.9012 36.2202C58.1591 34.3386 60.7395 33.4062 63.7031 33.4062C66.6662 33.4062 69.2095 34.3379 71.4011 36.2087L71.416 36.2214L71.4312 36.2337C73.7588 38.118 75.7391 40.6991 77.3474 44.0305C78.9664 47.3842 80.1946 51.2585 81.0177 55.6678L81.0194 55.6773L81.0213 55.6868C81.9042 60.101 82.3472 64.6994 82.3472 69.4844C82.3472 74.1528 81.9336 78.6976 81.108 83.1203C80.2852 87.5279 79.0577 91.4008 77.4397 94.7536C75.8319 98.0251 73.8473 100.616 71.5051 102.568C69.2471 104.45 66.6667 105.382 63.7031 105.382C60.6755 105.382 58.0689 104.447 55.8178 102.574C53.5333 100.622 51.5761 98.0288 49.9662 94.7527C48.3483 91.4002 47.1209 87.5275 46.2983 83.1203C45.4727 78.6976 45.0591 74.1528 45.0591 69.4844C45.0591 64.6966 45.4725 60.0949 46.2965 55.6774C47.1794 51.2661 48.4378 47.3883 50.0588 44.0305C51.6707 40.6917 53.6259 38.107 55.8984 36.2225ZM181.422 134.668H182.922V133.168V5.43896V3.93896H181.422H166.877H166.46L166.103 4.15378C159.628 8.05097 154.017 11.0934 149.265 13.2914C144.492 15.4989 140.127 17.2196 136.167 18.4608L135.116 18.7903V19.8921V44.6431V46.4425L136.886 46.1186L155.35 42.7389V133.168V134.668H156.85H181.422Z" stroke="white" stroke-width="3" />
            </svg>
            <div class="absolute left-[-30px] top-0 flex h-full items-center">
              <span class="flex w-[260px] items-center justify-center bg-white py-1 text-[20px] font-medium text-black">О НАС</span>
            </div>
          </div>
          <h2 class="mb-[30px] text-h2 text-white">
            ваше мероприятие в надежных руках
          </h2>
          <p class="text-p-small text-white">
            Выбирая нашу компанию, вы приобретаете надежного партнера с четко отработанной схемой работы, с командой профессионалов и многолетним опытом работы в данной сфере. 
            <br>
            <br>
            Мы провели: более 1983 мероприятий
Закрыли: 1319 контрактов  
Наши мероприятия посетило: более 319 000 тысяч человек  
Наши заказчики: Департаменты города Москвы, Префектуры, Управы и Округа
          </p>
          <Button text="Наши кейсы" class="mt-[100px]" />
        </div>
        <p class="slide absolute right-12 origin-right whitespace-nowrap text-h1 text-white transition-opacity duration-300" :class="`${isShownContent ? 'opacity-0' : 'opacity-1'}`">
          РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити         РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити РМТ-Комьюнити
        </p>
      </div>
    </section>
    <section class="section-words relative h-screen w-full">
      <svg class="banner absolute inset-0 h-full w-full">
        <mask id="mask">
          <rect fill="white" width="100%" height="100%" />
          <text id="gtheading" class="text-svg" dominant-baseline="central" x="50%" y="50%" text-anchor="middle">EVENT</text>
        </mask>
        <rect id="mask-bg" width="100%" height="100%" />
      </svg>
    </section>

    <section class="section-achieve relative w-full bg-black">
      <p class="sticky top-[130px] whitespace-nowrap bg-white text-h3 text-black overflow-hidden">
        ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ / ДОСТИЖЕНИЯ
      </p>
      <div class="flex flex-col pt-[15%]">
        <div class="achievment achievment-1 w-[50%] self-start" data-direction="left">
          <div class="border-b-4 border-white text-right">
            <span class="text-[107px] font-bold text-white">7</span>
          </div>
          <p class="py-2 text-right text-h3 uppercase text-white">
            Лет на рынке
          </p>
        </div>
        <div class="achievment achievment-2 w-[40%] self-end" data-direction="right">
          <div class="border-b-4 border-white">
            <span class="text-[107px] font-bold text-white">900</span>
          </div>
          <p class="py-2 text-left text-h3 uppercase text-white">
            КОНтрактов
          </p>
        </div>
        <div class="achievment achievment-3 w-[40%] self-start" data-direction="left">
          <div class="border-b-4 border-white text-right">
            <span class="text-[107px] font-bold text-white">250</span>
          </div>
          <p class="whitespace-nowrap py-2 text-right text-h3 uppercase text-white">
            ГОСУДАРСТВЕННЫХ ЗАКАЗЧИКОВ
          </p>
        </div>
        <div class="achievment achievment-4 w-[50%] self-end" data-direction="right">
          <div class="border-b-4 border-white">
            <span class="text-[107px] font-bold text-white">1500</span>
          </div>
          <p class="py-2 text-left text-h3 uppercase text-white">
            МЕРОПРИЯТИЙ
          </p>
        </div>
        <div class="achievment achievment-5 w-[45%] self-start" data-direction="left">
          <div class="border-b-4 border-white text-right">
            <span class="text-[107px] font-bold text-white">300 тыс</span>
          </div>
          <p class="whitespace-nowrap py-2 text-right text-h3 uppercase text-white">
            участников
          </p>
        </div>
        <div class="achievment achievment-6 w-[50%] self-end" data-direction="right">
          <div class="border-b-4 border-white">
            <span class="text-[107px] font-bold text-white">2890</span>
          </div>
          <p class="py-2 text-left text-h3 uppercase text-white">
            ПАРТНЕРОВ
          </p>
        </div>
      </div>
    </section>

    <section class="section-cases bg-cases py-[200px] relative z-10 overflow-hidden">
      <svg class="absolute bottom-[-50%] left-0" width="284" height="813" viewBox="0 0 284 813" fill="none" xmlns="http://www.w3.org/2000/svg">
        <path d="M-212.391 652.283C-104.981 692.493 20.3252 659.128 92.3279 562.562C127.037 516.012 144.136 461.782 144.786 407.847M-383.749 421.059C-387.581 360.658 -370.816 298.636 -331.804 246.316C-253.493 141.289 -112.129 111.023 0.68729 168.865" stroke="#FCFCFC" stroke-width="5"/>
        <path d="M-249.129 624.779L-241.106 629.334L-230.77 611.126L-222.87 615.611L-247.396 658.815L-255.296 654.33L-245.03 636.246L-253.3 631.551L-275.972 642.593L-284.489 637.757L-257.861 625.208L-260.519 594.239L-251.446 599.389L-249.129 624.779Z" fill="#FCFCFC"/>
        <path d="M-292.876 576.32L-287.983 570.328L-259.122 593.893L-290.542 632.375L-318.634 609.438L-313.741 603.446L-292.796 620.547L-284.627 610.542L-303.208 595.371L-298.405 589.488L-279.824 604.66L-271.161 594.05L-292.876 576.32Z" fill="#FCFCFC"/>
        <path d="M-326.156 601.684L-332.048 594.769L-305.198 571.894L-349.353 574.457L-354.923 567.92L-317.107 535.702L-311.215 542.617L-338.011 565.445L-293.909 562.929L-288.34 569.466L-326.156 601.684ZM-343.009 587.046C-340.248 590.288 -338.828 593.304 -338.749 596.096C-338.701 598.852 -339.94 601.338 -342.466 603.552L-346.654 598.636C-345.353 597.465 -344.694 596.158 -344.68 594.716C-344.665 593.274 -345.333 591.761 -346.683 590.176C-348.002 588.627 -349.391 587.728 -350.847 587.477C-352.335 587.19 -353.76 587.597 -355.123 588.696L-359.266 583.834C-356.714 581.722 -354.033 580.929 -351.222 581.456C-348.478 581.978 -345.74 583.841 -343.009 587.046Z" fill="#FCFCFC"/>
        <path d="M-329.358 511.695C-326.875 516.053 -325.573 520.538 -325.45 525.151C-325.392 529.747 -326.475 534.011 -328.699 537.946C-330.946 541.84 -334.187 544.992 -338.422 547.404C-342.656 549.816 -347.033 550.975 -351.552 550.881C-356.07 550.786 -360.271 549.53 -364.152 547.113C-368.098 544.678 -371.312 541.281 -373.795 536.923C-375.808 533.388 -377.03 529.809 -377.459 526.188C-377.888 522.566 -377.505 519.081 -376.309 515.731L-368.487 518.137C-370.078 523.181 -369.574 527.986 -366.975 532.549C-365.289 535.509 -363.121 537.786 -360.471 539.38C-357.861 540.998 -355.031 541.809 -351.979 541.813C-348.928 541.817 -345.942 540.988 -343.023 539.326C-340.104 537.663 -337.868 535.518 -336.315 532.891C-334.762 530.264 -333.995 527.405 -334.014 524.312C-334.075 521.243 -334.948 518.228 -336.634 515.268C-339.233 510.704 -343.129 507.832 -348.321 506.651L-346.338 498.661C-342.847 499.34 -339.642 500.809 -336.722 503.067C-333.826 505.283 -331.371 508.159 -329.358 511.695Z" fill="#FCFCFC"/>
        <path d="M-377.434 483.801C-379.213 478.111 -379.289 473.351 -377.661 469.521C-376.092 465.659 -372.802 462.945 -367.789 461.378C-362.551 459.74 -358.009 460.154 -354.165 462.62C-350.365 465.1 -347.519 469.366 -345.627 475.417L-339.252 495.806L-386.667 510.632L-389.379 501.962L-373.325 496.942L-377.434 483.801ZM-352.274 477.942C-353.347 474.51 -354.963 472.115 -357.123 470.758C-359.282 469.401 -361.875 469.195 -364.9 470.141C-370.635 471.934 -372.387 476.398 -370.156 483.533L-366.619 494.845L-348.737 489.254L-352.274 477.942ZM-401.155 464.3L-403.866 455.63L-356.45 440.804L-353.739 449.474L-401.155 464.3Z" fill="#FCFCFC"/>
        <path d="M29.2802 199.207L21.5818 194.122L10.0429 211.591L2.46285 206.585L29.8433 165.132L37.4233 170.138L25.9626 187.489L33.898 192.731L57.2617 183.242L65.4339 188.64L38.0206 199.366L38.5864 230.445L29.8812 224.695L29.2802 199.207Z" fill="#FCFCFC"/>
        <path d="M69.6628 250.503L64.3777 256.151L37.1694 230.696L71.1104 194.418L97.5931 219.195L92.308 224.844L72.5626 206.37L63.7379 215.803L81.2549 232.191L76.0668 237.736L58.5498 221.348L49.1918 231.35L69.6628 250.503Z" fill="#FCFCFC"/>
        <path d="M104.577 227.437L109.989 234.733L81.6598 255.747L125.887 256.165L131.003 263.062L91.103 292.66L85.6909 285.364L113.963 264.392L69.7927 263.932L64.6766 257.035L104.577 227.437ZM120.406 243.177C117.869 239.757 116.655 236.651 116.764 233.86C116.902 231.107 118.306 228.711 120.975 226.672L124.823 231.859C123.445 232.94 122.701 234.199 122.589 235.637C122.477 237.075 123.042 238.63 124.282 240.302C125.494 241.936 126.818 242.927 128.255 243.275C129.719 243.661 131.169 243.352 132.603 242.347L136.409 247.477C133.72 249.412 130.992 250.022 128.223 249.308C125.52 248.602 122.915 246.559 120.406 243.177Z" fill="#FCFCFC"/>
        <path d="M101.709 317.437C99.5257 312.922 98.5284 308.359 98.7168 303.748C98.9683 299.16 100.336 294.977 102.82 291.201C105.324 287.468 108.77 284.541 113.158 282.42C117.545 280.298 121.99 279.437 126.492 279.836C130.994 280.234 135.1 281.77 138.81 284.444C142.583 287.139 145.561 290.744 147.744 295.26C149.515 298.923 150.493 302.576 150.677 306.218C150.861 309.86 150.244 313.312 148.825 316.573L141.183 313.646C143.11 308.72 142.931 303.893 140.645 299.165C139.163 296.098 137.153 293.68 134.616 291.911C132.122 290.121 129.352 289.121 126.308 288.911C123.263 288.702 120.229 289.328 117.204 290.79C114.18 292.252 111.805 294.241 110.078 296.758C108.352 299.274 107.394 302.076 107.205 305.163C107.058 308.229 107.726 311.296 109.209 314.363C111.495 319.091 115.188 322.219 120.289 323.747L117.772 331.586C114.335 330.672 111.236 328.991 108.475 326.542C105.735 324.135 103.48 321.101 101.709 317.437Z" fill="#FCFCFC"/>
        <path d="M147.796 348.507C149.188 354.304 148.943 359.059 147.061 362.771C145.236 366.518 141.77 369.004 136.663 370.23C131.326 371.512 126.823 370.793 123.153 368.073C119.529 365.342 116.977 360.895 115.497 354.73L110.51 333.958L158.816 322.359L160.937 331.193L144.582 335.12L147.796 348.507ZM122.299 352.659C123.138 356.155 124.589 358.653 126.653 360.153C128.716 361.653 131.288 362.032 134.371 361.292C140.214 359.889 142.262 355.553 140.517 348.284L137.75 336.76L119.531 341.134L122.299 352.659ZM170.15 369.562L172.271 378.395L123.964 389.994L121.843 381.16L170.15 369.562Z" fill="#FCFCFC"/>
      </svg>
      <svg class="absolute top-[0%] right-0" width="602" height="349" viewBox="0 0 602 349" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M327.738 197.523C437.788 229.817 560.336 187.428 625.127 85.8824C656.359 36.932 669.47 -18.3977 666.197 -72.2369M140.022 -20.629C131.808 -80.591 144.018 -143.668 179.122 -198.687C249.59 -309.13 388.379 -349.595 505.102 -300.108" stroke="#FCFCFC" stroke-width="5"/>
<path d="M289.096 172.764L297.43 176.723L306.414 157.813L314.62 161.711L293.3 206.584L285.095 202.685L294.019 183.903L285.429 179.822L263.62 192.482L254.774 188.279L280.419 173.827L275.517 143.133L284.94 147.61L289.096 172.764Z" fill="#FCFCFC"/>
<path d="M241.942 127.614L246.386 121.282L276.884 142.686L248.346 183.351L218.661 162.518L223.105 156.185L245.238 171.719L252.658 161.146L233.023 147.366L237.385 141.15L257.02 154.93L264.889 143.718L241.942 127.614Z" fill="#FCFCFC"/>
<path d="M210.594 155.331L204.216 148.863L229.331 124.096L185.479 129.863L179.449 123.748L214.822 88.8654L221.201 95.3336L196.136 120.05L239.938 114.334L245.967 120.449L210.594 155.331ZM192.721 141.958C195.711 144.99 197.347 147.895 197.629 150.674C197.877 153.419 196.822 155.988 194.463 158.38L189.929 153.782C191.142 152.519 191.703 151.168 191.613 149.728C191.523 148.289 190.747 146.828 189.285 145.346C187.856 143.898 186.407 143.101 184.936 142.957C183.431 142.779 182.039 143.288 180.76 144.484L176.275 139.936C178.666 137.644 181.283 136.658 184.124 136.979C186.899 137.3 189.764 138.959 192.721 141.958Z" fill="#FCFCFC"/>
<path d="M200.858 65.8131C203.65 69.9791 205.276 74.3579 205.733 78.9497C206.125 83.5285 205.355 87.8608 203.424 91.9468C201.465 95.9935 198.462 99.3736 194.414 102.087C190.366 104.8 186.085 106.274 181.572 106.509C177.058 106.743 172.778 105.796 168.731 103.667C164.618 101.526 161.165 98.3717 158.373 94.2058C156.107 90.8259 154.629 87.3456 153.938 83.7648C153.246 80.1841 153.375 76.6801 154.324 73.2527L162.301 75.0829C161.08 80.23 161.932 84.9848 164.856 89.3472C166.753 92.1769 169.081 94.2904 171.841 95.6875C174.56 97.111 177.442 97.714 180.486 97.4964C183.53 97.2787 186.447 96.2347 189.238 94.3642C192.028 92.4938 194.102 90.1922 195.46 87.4593C196.818 84.7263 197.375 81.8183 197.131 78.7351C196.848 75.6783 195.758 72.735 193.861 69.9053C190.937 65.5428 186.842 62.9615 181.578 62.1611L182.975 54.0479C186.506 54.472 189.81 55.7038 192.885 57.7432C195.935 59.7433 198.592 62.4332 200.858 65.8131Z" fill="#FCFCFC"/>
<path d="M150.881 41.4889C148.693 35.9435 148.271 31.2014 149.616 27.2627C150.9 23.2974 153.984 20.351 158.87 18.4233C163.975 16.4088 168.535 16.4916 172.548 18.6717C176.518 20.8692 179.667 24.9167 181.994 30.8143L189.835 50.6854L143.623 68.9202L140.288 60.4701L155.934 54.2962L150.881 41.4889ZM175.548 33.8153C174.228 30.4705 172.442 28.1997 170.19 27.0031C167.937 25.8064 165.337 25.7899 162.388 26.9534C156.799 29.1589 155.376 33.7386 158.12 40.6925L162.47 51.7173L179.899 44.8402L175.548 33.8153ZM125.805 23.7644L122.47 15.3142L168.682 -2.92054L172.017 5.52966L125.805 23.7644Z" fill="#FCFCFC"/>
<path d="M535.825 -271.925L527.777 -276.437L517.539 -258.175L509.615 -262.617L533.909 -305.951L541.833 -301.509L531.664 -283.371L539.959 -278.72L562.571 -289.883L571.114 -285.094L544.554 -272.402L547.378 -241.447L538.277 -246.548L535.825 -271.925Z" fill="#FCFCFC"/>
<path d="M579.83 -223.702L574.97 -217.683L545.983 -241.093L577.196 -279.743L605.41 -256.957L600.55 -250.939L579.513 -267.928L571.398 -257.879L590.06 -242.808L585.289 -236.9L566.627 -251.971L558.021 -241.315L579.83 -223.702Z" fill="#FCFCFC"/>
<path d="M612.975 -249.245L618.903 -242.362L592.177 -219.343L636.318 -222.142L641.922 -215.635L604.279 -183.215L598.351 -190.098L625.023 -213.07L580.936 -210.318L575.332 -216.824L612.975 -249.245ZM629.906 -234.698C627.127 -237.924 625.691 -240.933 625.597 -243.725C625.534 -246.48 626.76 -248.972 629.274 -251.2L633.489 -246.307C632.193 -245.129 631.542 -243.818 631.535 -242.376C631.528 -240.934 632.204 -239.425 633.563 -237.847C634.891 -236.306 636.283 -235.413 637.742 -235.17C639.23 -234.892 640.654 -235.306 642.011 -236.412L646.179 -231.573C643.639 -229.447 640.962 -228.64 638.148 -229.152C635.402 -229.658 632.654 -231.507 629.906 -234.698Z" fill="#FCFCFC"/>
<path d="M616.658 -159.274C614.153 -163.619 612.826 -168.097 612.679 -172.71C612.596 -177.304 613.656 -181.575 615.859 -185.522C618.085 -189.427 621.309 -192.597 625.531 -195.032C629.752 -197.466 634.123 -198.649 638.642 -198.578C643.161 -198.508 647.368 -197.275 651.262 -194.878C655.221 -192.464 658.454 -189.085 660.959 -184.741C662.992 -181.216 664.233 -177.644 664.681 -174.025C665.13 -170.405 664.765 -166.918 663.587 -163.562L655.752 -165.926C657.317 -170.979 656.787 -175.78 654.163 -180.33C652.461 -183.281 650.281 -185.546 647.622 -187.126C645.004 -188.73 642.17 -189.525 639.118 -189.513C636.066 -189.501 633.085 -188.656 630.175 -186.978C627.265 -185.3 625.041 -183.143 623.502 -180.508C621.963 -177.873 621.212 -175.009 621.247 -171.916C621.324 -168.847 622.213 -165.837 623.915 -162.886C626.539 -158.336 630.45 -155.485 635.648 -154.332L633.708 -146.331C630.213 -146.992 627.001 -148.444 624.069 -150.686C621.161 -152.887 618.691 -155.75 616.658 -159.274Z" fill="#FCFCFC"/>
<path d="M664.883 -131.638C666.693 -125.957 666.794 -121.198 665.187 -117.359C663.639 -113.489 660.363 -110.757 655.359 -109.163C650.129 -107.497 645.586 -107.886 641.728 -110.332C637.915 -112.792 635.046 -117.042 633.122 -123.083L626.637 -143.437L673.973 -158.518L676.73 -149.862L660.704 -144.756L664.883 -131.638ZM639.755 -125.643C640.846 -122.217 642.475 -119.831 644.642 -118.485C646.809 -117.14 649.402 -116.948 652.423 -117.91C658.148 -119.734 659.876 -124.208 657.607 -131.331L654.009 -142.624L636.157 -136.936L639.755 -125.643ZM688.708 -112.264L691.466 -103.609L644.13 -88.5282L641.373 -97.1839L688.708 -112.264Z" fill="#FCFCFC"/>
</svg>


      <div class="container">
        <div class="flex gap-3 mb-[60px]">
          <p v-for="(item, idx) in 6" :key="idx" class="hover:bg-black transition-all hover:border-black cursor-pointer py-3 px-7 border border-white rounded-[40px] text-white text-h3">
            ФОРУМЫ
          </p>
        </div>
        <Swiper
          :modules="[SwiperMousewheel]"
          :slides-per-view="1"
          :pagination="{ clickable: true }"
          :space-between="10"
          :speed="600"
          :mousewheel="{
            forceToAxis: true,
          }"
          :breakpoints="{
            360: {
              slidesPerView: 1.2,
            },
            600: {
              slidesPerView: 2.2,
            },
            992: {
              slidesPerView: 3,
              spaceBetween: 40,
            },
          }"
          class="swiper"
        >
          <SwiperSlide class="h-[200px] w-[200px]" v-for="item in 5" :key="item">
            <TaskPlate />
          </SwiperSlide>
        </Swiper>
      </div>
    </section>
    <section class="bg-white py-[200px] z-30 relative">
      <div class="container">
        <svg class="mb-[100px]" width="460" height="89" viewBox="0 0 460 89" fill="none" xmlns="http://www.w3.org/2000/svg">
          <path d="M152.82 78.3591L152.374 84.9098C156.259 85.8388 159.755 86.3033 162.863 86.3033C169.546 86.3033 174.713 84.3292 178.365 80.3812C182.017 76.3557 184.581 70.7045 186.057 63.4276C187.611 56.1507 188.583 46.7063 188.971 35.0943L189.437 21.8566H212.865V84.9098H235.592V3.62568H169.857L168.691 36.0232C168.458 42.913 167.992 48.5255 167.292 52.8607C166.593 57.1184 165.427 60.4472 163.796 62.847C162.164 65.2468 159.833 66.4467 156.803 66.4467C156.154 66.4467 155.519 66.4054 154.898 66.3229M152.82 78.3591C155.628 76.3301 158.127 73.9463 160.317 71.2076L154.898 66.3229M152.82 78.3591C150.548 80.0008 148.074 81.4103 145.399 82.5874C139.416 85.2195 132.694 86.5355 125.235 86.5355C116.688 86.5355 108.995 84.755 102.157 81.194C95.3974 77.5556 90.0748 72.5237 86.1897 66.0984C82.3046 59.673 80.362 52.3962 80.362 44.2678C80.362 36.1393 82.3046 28.8625 86.1897 22.4372C90.0748 16.0118 95.3974 11.0187 102.157 7.45765C108.995 3.81922 116.688 2 125.235 2C132.694 2 139.416 3.31603 145.399 5.94809C151.382 8.58015 156.355 12.3734 160.317 17.3279L145.632 30.5656C140.348 24.2177 133.938 21.0437 126.4 21.0437C121.971 21.0437 118.009 22.0114 114.512 23.9467C111.093 25.8821 108.412 28.6302 106.47 32.1913C104.605 35.6749 103.673 39.7004 103.673 44.2678C103.673 48.8352 104.605 52.8994 106.47 56.4604C108.412 59.944 111.093 62.6535 114.512 64.5888C118.009 66.5241 121.971 67.4918 126.4 67.4918C133.938 67.4918 140.348 64.3178 145.632 57.9699L154.898 66.3229M88.5499 3.62568L54.7495 66.4467C51.1752 73.1817 46.7851 78.291 41.579 81.7746C36.4507 85.2582 30.8173 87 24.6789 87C20.1721 87 15.3546 85.9936 10.2263 83.9809L15.7043 67.0273C18.8901 67.9563 21.6096 68.4208 23.863 68.4208C26.1163 68.4208 28.0977 67.9176 29.8072 66.9112C31.5943 65.9048 33.2261 64.3179 34.7024 62.1503L3 3.62568H27.3596L46.3577 42.8743L66.0552 3.62568H88.5499ZM321.228 3.62568L287.428 66.4467C283.853 73.1817 279.463 78.291 274.257 81.7746C269.129 85.2582 263.495 87 257.357 87C252.85 87 248.033 85.9936 242.904 83.9809L248.382 67.0273C251.568 67.9563 254.288 68.4208 256.541 68.4208C258.794 68.4208 260.776 67.9176 262.485 66.9112C264.272 65.9048 265.904 64.3179 267.38 62.1503L235.678 3.62568H260.038L279.036 42.8743L298.733 3.62568H321.228ZM378.982 21.8566H342.034V84.9098H319.307V3.62568H379.098L378.982 21.8566ZM380.096 3.62568H402.824V51.3511L436.508 3.62568H458.187V84.9098H435.459V37.3005L401.892 84.9098H380.096V3.62568Z" stroke="#070707" stroke-width="3"/>
        </svg>
        <div class="flex gap-[70px] flex-wrap justify-center">
          <div class="w-[400px] py-[40px] px-[80px] bg-black rounded-[34px]">
            <div class="uppercase text-h1 text-white mb-[40px]">
              Организация мероприятий
            </div>
            <div>
              <div class="text-p-small flex items-center text-white">
                <div class="w-[4px] h-[4px] rounded-full bg-white mr-[10px]"></div>
                Форумов
              </div>
            </div>
          </div>
          <div class="w-[400px] py-[40px] px-[80px] bg-black rounded-[34px]">
            <div class="uppercase text-h1 text-white mb-[40px]">
              Организация мероприятий
            </div>
            <div>
              <div class="text-p-small flex items-center text-white">
                <div class="w-[4px] h-[4px] rounded-full bg-white mr-[10px]"></div>
                Форумов
              </div>
            </div>
          </div>
          <div class="w-[400px] py-[40px] px-[80px] bg-black rounded-[34px]">
            <div class="uppercase text-h1 text-white mb-[40px]">
              Организация мероприятий
            </div>
            <div>
              <div class="text-p-small flex items-center text-white">
                <div class="w-[4px] h-[4px] rounded-full bg-white mr-[10px]"></div>
                Форумов
              </div>
            </div>
          </div>
          <div class="w-[400px] py-[40px] px-[80px] bg-black rounded-[34px]">
            <div class="uppercase text-h1 text-white mb-[40px]">
              Организация мероприятий
            </div>
            <div>
              <div class="text-p-small flex items-center text-white">
                <div class="w-[4px] h-[4px] rounded-full bg-white mr-[10px]"></div>
                Форумов
              </div>
            </div>
          </div>
          <div class="w-[400px] py-[40px] px-[80px] bg-black rounded-[34px]">
            <div class="uppercase text-h1 text-white mb-[40px]">
              Организация мероприятий
            </div>
            <div>
              <div class="text-p-small flex items-center text-white">
                <div class="w-[4px] h-[4px] rounded-full bg-white mr-[10px]"></div>
                Форумов
              </div>
            </div>
          </div>
        </div>
      </div>
    </section>
    <section class="bg-white relative z-30">
      <div class="container">
        <div class="flex gap-[50px] justify-center mb-[40px]">
          <img src="~/assets/images/1.png" class="w-[90px] h-[90px] object-contain" alt="">
          <img src="~/assets/images/2.png" class="w-[90px] h-[90px] object-contain" alt="">
          <img src="~/assets/images/3.png" class="w-[90px] h-[90px] object-contain" alt="">
          <img src="~/assets/images/4.png" class="w-[90px] h-[90px] object-contain" alt="">
          <img src="~/assets/images/5.png" class="w-[90px] h-[90px] object-contain" alt="">
        </div>
        <div class="flex gap-[50px] justify-center mb-[40px]">
          <img src="~/assets/images/1s.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/2s.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/3s.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/4s.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/5s.png" class="h-[90px] w-[150px] object-contain" alt="">
        </div>
        <div class="flex gap-[50px] justify-center">
          <img src="~/assets/images/1e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/2e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/3e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/4e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/5e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/6e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/7e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/8e.png" class="h-[90px] w-[150px] object-contain" alt="">
          <img src="~/assets/images/9e.png" class="h-[90px] w-[150px] object-contain" alt="">
        </div>
      </div>
    </section>
    <footer class="relative z-30 bg-white py-[200px]">
      <div class="container">
        <div class="flex gap-[300px]">
          <div class="rounded-[40px] bg-black p-[40px]">
            <p class="text-h2 text-white mb-[26px]">ФОРМА ДЛЯ ОБРАТНОЙ СВЯЗИ</p>
            <div class="px-[30px]">
              <p class="text-white text-h2 text-center mb-[34px]">ОСТАВЬТЕ ЗАЯКУ, И НАШ МЕНЕДЖЕР СВЯЖЕТСЯ С ВАМИ</p>
              <div class="uppercase flex flex-col gap-[30px] text-white">
                <label>
                  <span class="text-h2 mb-3 ml-2 block">ИМЯ</span>
                  <input type="text" class="h-[60px] w-full border-white border rounded-[23px] bg-black">
                </label>
                <label>
                  <span class="text-h2 mb-3 ml-2 block">Номер телефона</span>
                  <input type="text" class="h-[60px] w-full border-white border rounded-[23px] bg-black">
                </label>
                <label>
                  <span class="text-h2 mb-3 ml-2 block">EMAIL</span>
                  <input type="text" class="h-[60px] w-full border-white border rounded-[23px] bg-black">
                </label>
              </div>
              <div class="flex justify-center">
                <button class="mt-[50px] text-h2 text-black py-[24px] px-[86px] bg-white hover:bg-black hover:text-white transition-all">Отправить</button>
              </div>
            </div>
          </div>
        </div>
      </div>
    </footer>
  </div>
</template>

<style>
@keyframes slide {
  from {
    transform: rotate(270deg) translateX(0);
  }
  to {
    transform: rotate(270deg) translateX(100%);
  }
}

.slide {
  animation: slide 200s linear infinite;
}

.text-svg {
  font-size: 800px;
  font-weight: bold;
  transform: translateX(100%);
}

#mask-bg {
  mask: url('#mask')
}
</style>
